app/views/users/show.html.erb

    <tr>
      <%mycourse = Course.find(user_course.course_id)%>
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 6]]