app/views/courses/index.html.erb


        <% instrutor=User.find(course.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

        <td><%= course.fee %></td>
        <% course.numberofenrolled = course.user_courses.count %>
---
SELECT "courses".* FROM "courses"
SELECT COUNT(*) FROM "courses"