app/views/courses/show.html.erb

  <strong>Numberofenrolled:</strong>
  <%= @course.user_courses.count %>
---
SELECT "user_courses".* FROM "user_courses" WHERE "user_courses"."course_id" = $1  [["course_id", 4]]
SELECT COUNT(*) FROM "user_courses" WHERE "user_courses"."course_id" = $1  [["course_id", 1]]

    <tr>
      <%student = User.find(user_course.user_id)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]