app/controllers/courses_controller.rb

SELECT "user_courses".* FROM "user_courses" WHERE "user_courses"."course_id" = $1  [["course_id", 6]]
SELECT COUNT(*) FROM "user_courses" WHERE "user_courses"."course_id" = $1  [["course_id", 6]]
---
  def index
    @courses = Course.all.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "user_courses".* FROM "user_courses" WHERE "user_courses"."course_id" = $1  [["course_id", 4]]
---
  def show
    if @course.user_id
      @instrutor = User.find(@course.user_id)
    end
    @user_courses = @course.user_courses
    @user = current_user
    @gym = Gym.find(@course.gym_id)

INSERT INTO "courses" ("name", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["start", "2017-12-01 03:16:00.000000"], ["end", "2017-12-01 03:16:00.000000"], ["created_at", "2017-12-01 03:16:17.424804"], ["updated_at", "2017-12-01 03:16:17.424804"]]
---
  def create

      @course = Course.new(course_params)




      respond_to do |format|
        if @course.save

UPDATE "courses" SET "limit" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["limit", 3], ["updated_at", "2017-11-28 00:09:13.866919"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)