app/controllers/guides_controller.rb

SELECT COUNT(*) FROM "guides"
SELECT guides.*, users.name as user_name FROM "guides" INNER JOIN "users" ON "users"."id" = "guides"."user_id" WHERE (user_id = users.id)
SELECT "guides".* FROM "guides" WHERE "guides"."id" IN (NULL, NULL)
---
  def index
    if params[:search]
      if params[:type] == 'hits'
        @guides = Guide.search(params[:search]).order('hits DESC').paginate(page: params[:page], per_page: 8)
      elsif params[:type] == 'like'
        @guides = Guide.search(params[:search]).joins(:likeps).group('guides.id').order('COUNT(likeps.id) DESC').paginate(page: params[:page], per_page: 8)
      elsif params[:type] == 'favo'
        @guides = Guide.search(params[:search]).joins(:favorites).group('guides.id').where(:favorites => {:user_id => session[:user_id]}).paginate(page: params[:page], per_page: 8)
      elsif params[:type] == 'mine'
        @guides = Guide.search(params[:search]).where('user_id = ?', session[:user_id]).order('created_at DESC').paginate(page: params[:page], per_page: 8)
      else
        @guides = Guide.search(params[:search]).order('id DESC').paginate(page: params[:page], per_page: 8)

SELECT  "guides".* FROM "guides"  ORDER BY hits DESC LIMIT 5 OFFSET 0
SELECT  guides.*, users.name as user_name FROM "guides" INNER JOIN "users" ON "users"."id" = "guides"."user_id" WHERE (guides.user_id = users.id) LIMIT 5 OFFSET 0
---
      @index_type = 'norm'
    end

    @guides_hi = Guide.order('hits DESC').limit(5)
    @guides_li = Guide.joins(:likeps).group('guides.id').order('COUNT(likeps.id) DESC').limit(5)

SELECT  "guides".* FROM "guides" WHERE "guides"."id" = $1 LIMIT 1  [["id", 16]]
UPDATE "guides" SET "hits" = $1, "updated_at" = $2 WHERE "guides"."id" = $3  [["hits", 2], ["updated_at", "2017-11-26 05:02:52.961589"], ["id", 16]]
---
  def show
    @guide = Guide.find(params[:id])
    if @guide.user_id != session[:user_id]
      @guide.hits += 1
      @guide.save

SELECT  "guides".* FROM "guides" WHERE "guides"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @guide = Guide.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "guides" ("title", "content", "user_id", "user_name", "hits", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test2"], ["content", "<p>ttt<br></p>"], ["user_id", 3], ["user_name", "test2"], ["hits", 0], ["created_at", "2017-11-19 14:18:59.142884"], ["updated_at", "2017-11-19 14:18:59.142884"]]
---
  def create
    @guide = Guide.new(guide_params)
    @guide.user_id = session[:user_id]
    @guide.user_name  = User.find(session[:user_id]).name
    @guide.hits = 0

    if @guide.save

SELECT  "guides".* FROM "guides" WHERE "guides"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "guides" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "guides"."id" = $4
---
  def update
    @guide = Guide.find(params[:id])
    if @guide.update_attributes(guide_params)

DELETE FROM "guides" WHERE "guides"."id" = $1  [["id", 13]]
SELECT  "guides".* FROM "guides" WHERE "guides"."id" = $1 LIMIT 1  [["id", 13]]
---
  def destroy
    Guide.find(params[:id]).destroy