app/controllers/guides_controller.rb

  def index
      @totalCnt = Guide.all.count

      @guides = Guide.all
       if params[:search]
        @guides = Guide.search(params[:search]).order('id DESC').paginate(page: params[:page], per_page: 5)
---
SELECT  "guides".* FROM "guides"  ORDER BY "guides"."id" ASC LIMIT 1
SELECT  guides.*, users.name as user_name FROM "guides" LIMIT 5 OFFSET 0