app/controllers/gyms_controller.rb

SELECT "gyms".* FROM "gyms"
---
    def index
        @gyms = Gym.all.paginate(page: params[:page], per_page: 5)

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
      @gym = Gym.find(params[:id])

INSERT INTO "gyms" ("name", "address", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "SteveNash"], ["address", "abc street"], ["description", "hi thee"], ["created_at", "2017-12-01 05:17:52.377984"], ["updated_at", "2017-12-01 05:17:52.377984"]]
---
    def create
      @gym = Gym.new(gym_params)
      if User.where(:id => @gym.user_id).present?
        @manager = User.find(@gym.user_id)
        if @manager.type == 'Manager'
          # Handle a successful save.
          if @gym.save

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT 1  [["id", 1]]
---
    def edit
      @gym = Gym.find(params[:id])

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "gyms" SET "description" = $1, "updated_at" = $2 WHERE "gyms"."id" = $3  [["description", "hi there"], ["updated_at", "2017-12-01 05:25:15.706611"], ["id", 1]]
---
    def update
      @gym = Gym.find(params[:id])
      if current_user.admin?
        if User.where(:id => gym_params[:user_id]).present?
          @manager = User.find(gym_params[:user_id])
          if @manager.type == 'Manager'
            if @gym.update(gym_params)