app/controllers/images_controller.rb

INSERT INTO "images" ("image_size", "image_content_type", "image_filename", "image_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  	puts "start1"
  	puts image_params
  	@image = Image.new(image_params)
  	puts "start2"
    if @image.save