app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users"
---
  def index
      @userCnt = User.all.count
      #@users = User.order('id DESC').paginate(page: params[:page], per_page: 10)
      @users = User.all

INSERT INTO "users" ("name", "email", "password_digest", "height", "weight", "description", "date_of_birth", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save