app/controllers/user_courses_controller.rb

  def index
    @user_courses = UserCourse.all
---
SELECT "user_courses".* FROM "user_courses"

  def create

    @user = User.find(current_user.id)
    @user_course = UserCourse.new(user_id: current_user.id, course_id: params[:course_id] )

    respond_to do |format|
      if @user_course.save
        @course = Course.find(params[:course_id])
        @course.numberofenrolled = @course.user_courses.count
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 101]]
INSERT INTO "user_courses" ("user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 101], ["course_id", 1], ["created_at", "2017-11-27 23:49:17.323358"], ["updated_at", "2017-11-27 23:49:17.323358"]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 4]]
SELECT COUNT(*) FROM "user_courses" WHERE "user_courses"."course_id" = $1  [["course_id", 4]]

  def destroy
    @user_course.destroy
---
DELETE FROM "user_courses" WHERE "user_courses"."id" = $1  [["id", 1]]

    def set_user_course
      @user_course = UserCourse.find(params[:id])
---
SELECT  "user_courses".* FROM "user_courses" WHERE "user_courses"."id" = $1 LIMIT 1  [["id", 1]]