app/views/guides/index.html.erb

SELECT  "guides".* FROM "guides"  ORDER BY "guides"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "guides"
---
              <% @guides_li.each do |gl| %>
                <li><a href="guides/<%=gl.id%>" style="color:black" data-toggle="tooltip" data-placement="top" title="<%= gl.title%>"><%= gl.title %></a>(<%= gl.likeps.count %>)</li>